app/controllers/advisors_controller.rb

SELECT "advisors".* FROM "advisors" ORDER BY last_name
---
	def index

		@advisors = Advisor.all

SELECT "advisors".* FROM "advisors" WHERE "advisors"."id" = ? ORDER BY last_name LIMIT 1  [["id", "1"]]
---
	def show

		@advisor = Advisor.find(params[:id])

SELECT "advisors".* FROM "advisors" WHERE "advisors"."id" = ? ORDER BY last_name LIMIT 1  [["id", "1"]]
---
	def edit

		@advisor = Advisor.find(params[:id])

INSERT INTO "advisors" ("created_at", "email", "first_name", "last_name", "phone_number", "updated_at") VALUES (?, ?, ?, ?, ?, ?)
---
	def create

		@advisor = Advisor.new(params[:advisor])

		respond_to do |format|

			if @advisor.save