app/controllers/researches_controller.rb

SELECT "researches".* FROM "researches" WHERE "researches"."id" = ? LIMIT 1  [["id", "1"]]
---
  def show
    @research = Research.find(params[:id])

SELECT "advisors".* FROM "advisors" WHERE "advisors"."id" = ? ORDER BY last_name LIMIT 1  [["id", "1"]]
---
  def new
    @research = Research.new
    @advisor = Advisor.find(params[:advisor_id])

SELECT "researches".* FROM "researches" WHERE "researches"."id" = ? LIMIT 1  [["id", "1"]]
---
  def edit
    @research = Research.find(params[:id])

INSERT INTO "researches" ("academic_level", "academic_unit", "application_deadline", "class_required", "contact_info", "created_at", "description", "gpa", "paid", "requirements", "student_research_assistant", "title", "unmjobs_name", "unmjobs_number", "updated_at", "work_period") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    f = open('/tmp/research_create_params.txt', 'w')
    f.write(params)
    f.close()
    @advisor = Advisor.find(params[:advisor_id])
    @research = @advisor.researches.create!(params[:research])

SELECT "researches".* FROM "researches" WHERE "researches"."id" = ? LIMIT 1  [["id", "1"]]
DELETE FROM "researches" WHERE "researches"."id" = ?  [["id", 1]]
---
  def destroy
    @research = Research.find(params[:id])
    @research.destroy